src/toir_cf/src/ExchangePlans/mobileBrigades/mobileBrigades.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="a7d876bb-df41-4049-bf64-6a1fc661491e">
  <name>mobileBrigades</name>
  <attributes>
    <name>ИДМобильногоУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПодписчикаУведомлений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнийПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоСоединения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.торо_РемонтныеБригады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновляемоеРасстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодКонтроляПрисутствияНаОбъекте</name>
    <type>
      <types>EnumRef.торо_МетодыКонтроляПрисутствияНаОбъекте</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогрешностьГеоконтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияНачальныхДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

src/toir_cf/src/InformationRegisters/торо_ПорядокОРПоИерархии/торо_ПорядокОРПоИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПорядокОРПоИерархии</name>
  <resources>
    <name>РеквизитДопУпорядочиванияОР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_ОбщиеПрисоединенныеФайлы/торо_ОбщиеПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОбщиеПрисоединенныеФайлы</name>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВладелецФайла</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/InformationRegisters/торо_ПараметрыНаработкиОбъектовРемонта/торо_ПараметрыНаработкиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПараметрыНаработкиОбъектовРемонта</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПлановаяНаработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПлановойНаработки</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПродолжительностьПериодаПлановойНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентИспользованияОборудования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/ExchangePlans/mobileBrigades/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
// Первоначальная регистрация объектов в узле.
//
// Параметры:
//  Узел - ПланОбменаСсылка.mobileBrigades - узел обмена.
//  ПоследнийПользователь - Строка - имя последнего пользователя.
//  
Процедура ВыполнитьПервоначальнуюРегистрациюОбъектов(Узел, ПоследнийПользователь) Экспорт
	
	ИерархияДляМобильногоПриложения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ИерархияДляМобильногоПриложения",
	Справочники.торо_СтруктурыОР.ПустаяСсылка(),,
	ПоследнийПользователь);
	
	Если НЕ ЗначениеЗаполнено(ИерархияДляМобильногоПриложения) Тогда
		ТекстСообщения = НСтр("ru = 'Заполните иерархию для мобильного приложения!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РегистрацияСправочников(Узел); 
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта);
	
	// Регистры 
	РегистрацияПорядокОР(Узел, ИерархияДляМобильногоПриложения);
	РегистрацияОбщиеФайлы_Регистр(Узел); 
	РегистрацияВерсииТК_Регистр(Узел);
	РегистрацияПараметрыНаработкиОР_Регистр(Узел);
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта);
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.РегистрыСведений.торо_МаршрутыРегламентныхМероприятий);
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Метаданные.РегистрыСведений.торо_ВыходныеДокументы);

КонецПроцедуры    

// Процедура - При получении настроек
//
// Параметры:
//  Настройки	 - Структура - ключ - имя настройки, значение – значение настройки
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура РегистрацияСправочников(Узел)
	
	ВыбранныйПланОбмена = Метаданные.ПланыОбмена.mobileBrigades;
	Состав = ВыбранныйПланОбмена.Состав;
	
	Для каждого ЭлементСписка Из Состав Цикл
		ОбъектМетаданных = Метаданные.Справочники.Найти(ЭлементСписка.Метаданные.Имя); 
		Если НЕ ОбъектМетаданных = Неопределено Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, ОбъектМетаданных);
		КонецЕсли; 	
	КонецЦикла;
	
КонецПроцедуры

Процедура РегистрацияПорядокОР(Узел, СтруктураИерархии) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ПорядокОРПоИерархии.ОбъектРемонта КАК ОбъектРемонта
	               |ИЗ
	               |	РегистрСведений.торо_ПорядокОРПоИерархии КАК торо_ПорядокОРПоИерархии
	               |ГДЕ
	               |	торо_ПорядокОРПоИерархии.СтруктураИерархии = &СтруктураИерархии";
	
	Запрос.УстановитьПараметр("СтруктураИерархии", СтруктураИерархии);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.торо_ПорядокОРПоИерархии.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		НаборЗаписей.Отбор.СтруктураИерархии.Установить(СтруктураИерархии);
		НаборЗаписей.Прочитать();
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура РегистрацияВерсииТК_Регистр(Узел) 
	
	Выборка = РегистрыСведений.торо_ВерсииТехКарт.СрезПоследних(); 
	НаборЗаписей = РегистрыСведений.торо_ВерсииТехКарт.СоздатьНаборЗаписей();
	
	Для каждого ТекущийОбъект из Выборка Цикл
		НаборЗаписей.Отбор.Период.Установить(ТекущийОбъект.Период);
		НаборЗаписей.Отбор.ИдентификаторТехКарты.Установить(ТекущийОбъект.ИдентификаторТехКарты);
		НаборЗаписей.Прочитать();
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Процедура РегистрацияОбщиеФайлы_Регистр(Узел)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ОбщиеПрисоединенныеФайлы.Файл КАК Файл,
	               |	торо_ОбщиеПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
	               |ИЗ
	               |	РегистрСведений.торо_ОбщиеПрисоединенныеФайлы КАК торо_ОбщиеПрисоединенныеФайлы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
	               |		ПО торо_ОбщиеПрисоединенныеФайлы.Файл = Файлы.Ссылка
	               |ГДЕ
	               |	НЕ Файлы.ПометкаУдаления
	               |	И (ТИПЗНАЧЕНИЯ(торо_ОбщиеПрисоединенныеФайлы.ВладелецФайла) = ТИП(Справочник.торо_ОбъектыРемонта)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(торо_ОбщиеПрисоединенныеФайлы.ВладелецФайла) = ТИП(Справочник.торо_ТиповыеОР)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(торо_ОбщиеПрисоединенныеФайлы.ВладелецФайла) = ТИП(Справочник.торо_ТехКарты))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписей = РегистрыСведений.торо_ОбщиеПрисоединенныеФайлы.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей.Отбор.Файл.Установить(Выборка.Файл);
		НаборЗаписей.Отбор.ВладелецФайла.Установить(Выборка.ВладелецФайла);
		НаборЗаписей.Прочитать();
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Процедура РегистрацияПараметрыНаработкиОР_Регистр(Узел)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектРемонта
		|ПОМЕСТИТЬ вт_ОР
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка ССЫЛКА Справочник.торо_ОбъектыРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Период КАК Период,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Показатель КАК Показатель
		|ИЗ
		|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(
		|			,
		|			ОбъектРемонта В
		|				(ВЫБРАТЬ
		|					вт_ОР.ОбъектРемонта КАК ОбъектРемонта
		|				ИЗ
		|					вт_ОР КАК вт_ОР)) КАК торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.торо_ПараметрыНаработкиОбъектовРемонта.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(Выборка.ОбъектРемонта);
		НаборЗаписей.Отбор.Показатель.Установить(Выборка.Показатель);
		НаборЗаписей.Прочитать();
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
